ExchangePlans/АвтономнаяРабота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ExchangePlan>
		<Properties>
			<Name>АвтономнаяРабота</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьДанныеПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьДанныеПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоРазделамДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазделыДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/АвтономнаяРабота/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет настройки, влияющие на использование плана обмена.
// 
// Параметры:
//  Настройки - Структура - настройки плана обмена по умолчанию, см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию,
//                          описание возвращаемого значения функции.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса = Истина;
	
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;
	Настройки.Алгоритмы.ОписаниеОграниченийПередачиДанных     = Истина;
	
КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
// 
// Параметры:
//  ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                       см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                       описание возвращаемого значения.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Ложь;
	
	ОписаниеВарианта.КраткаяИнформацияПоОбмену = НСтр("ru = 'Автономное рабочее место позволяет работать с информационной базой
	|без постоянного подключения к сети Интернет и при необходимости выполнять синхронизацию данных с базой,
	|расположенной в «облачном» сервисе, в режиме SaaS (Software-as-a-Service).'");
	
	ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента = НСтр("ru = '1С:Зарплата и Управление Персоналом'");
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "ПланОбмена.АвтономнаяРабота.Форма.ПодробнаяИнформация";
	
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = НСтр("ru='Автономная работа'");
	
	ИспользуемыеТранспортыСообщенийОбмена = Новый Массив;
	ИспользуемыеТранспортыСообщенийОбмена.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.WS);
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = ИспользуемыеТранспортыСообщенийОбмена;
	
	ОписаниеВарианта.ОбщиеДанныеУзлов = СтрЗаменить("ИспользоватьОтборПоОрганизациям,
	| СинхронизироватьДанныеПоОрганизациям, Организации, ИспользоватьОтборПоПодразделениям,
	| СинхронизироватьДанныеПоПодразделениям, Подразделения", Символы.ПС, "");
	
	// Отборы
	СтруктураТабличнойЧастиОрганизации = Новый Структура;
	СтруктураТабличнойЧастиОрганизации.Вставить("Организация", Новый Массив);
	
	СтруктураТабличнойЧастиПодразделения = Новый Структура;
	СтруктураТабличнойЧастиПодразделения.Вставить("Подразделение", Новый Массив);
	
	ОписаниеВарианта.Отборы.Вставить("ИспользоватьОтборПоОрганизациям", Ложь);
	ОписаниеВарианта.Отборы.Вставить("ИспользоватьОтборПоПодразделениям", Ложь);
	ОписаниеВарианта.Отборы.Вставить("СинхронизироватьДанныеПоОрганизациям", Истина);
	ОписаниеВарианта.Отборы.Вставить("СинхронизироватьДанныеПоПодразделениям", Истина);
	ОписаниеВарианта.Отборы.Вставить("Организации", СтруктураТабличнойЧастиОрганизации);
	ОписаниеВарианта.Отборы.Вставить("Подразделения", СтруктураТабличнойЧастиПодразделения);
	
КонецПроцедуры

// Возвращает строку описания ограничений миграции данных для пользователя.
// Прикладной разработчик на основе установленных отборов на узле должен сформировать 
// строку описания ограничений удобную для восприятия пользователем.
// 
// Параметры:
//  НастройкаОтборовНаУзле - Структура - структура отборов на узле плана обмена.
//  ВерсияКорреспондента   - Строка    - версия корреспондента.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//
// Возвращаемое значение:
//  Строка - описание ограничений миграции данных для пользователя.
//
Функция ОписаниеОграниченийПередачиДанных(НастройкаОтборовНаУзле, ВерсияКорреспондента, ИдентификаторНастройки) Экспорт
	
	ОграничениеОтбора = "";
	
	// отбор по организациям
	Если НастройкаОтборовНаУзле.СинхронизироватьДанныеПоОрганизациям Тогда
		Если НастройкаОтборовНаУзле.ИспользоватьОтборПоОрганизациям Тогда
			СтрокаПредставленияОтбора = СтрСоединить(
				НастройкаОтборовНаУзле.Организации.Организация, "; ");
			ОграничениеОтбора = ОграничениеОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В автономном рабочем месте доступны данные только по организациям: %1'"), СтрокаПредставленияОтбора);
		Иначе
			ОграничениеОтбора = ОграничениеОтбора + НСтр("ru = 'В автономном рабочем месте доступны все организации.'");
		КонецЕсли;
	Иначе
		ОграничениеОтбора = ОграничениеОтбора + НСтр("ru = 'В автономном рабочем месте не используется синхронизация по организациям.'");
	КонецЕсли;
	
	// отбор по подразделениям
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Если НастройкаОтборовНаУзле.СинхронизироватьДанныеПоПодразделениям Тогда
			Если НастройкаОтборовНаУзле.ИспользоватьОтборПоПодразделениям Тогда
				СтрокаПредставленияОтбора = СтрСоединить(
					НастройкаОтборовНаУзле.Подразделения.Подразделение, "; ");
				ОграничениеОтбора = ОграничениеОтбора + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В автономном рабочем месте доступны данные только по подразделениям: %1'"), СтрокаПредставленияОтбора);
			Иначе
				ОграничениеОтбора = ОграничениеОтбора + Символы.ПС + НСтр("ru = 'В автономном рабочем месте доступны все подразделения.'");
			КонецЕсли;
		Иначе
			ОграничениеОтбора = ОграничениеОтбора + Символы.ПС + НСтр("ru = 'В автономном рабочем месте не используется синхронизация по подразделениям.'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОграничениеОтбора;
	
КонецФункции

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив из Строка - список имен реквизитов объекта.
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("РегистрироватьИзменения");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления 
//
Процедура ОбновитьГлавныйУзелВАвтономномРабочемМесте(ПараметрыОбновления) Экспорт
	
	Если Не ОбщегоНазначения.ЭтоАвтономноеРабочееМесто() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	Если ГлавныйУзел = Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Попытка
		ВыполнитьНастройкуГлавногоУзла(ГлавныйУзел);
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	Исключение
		ПараметрыОбновления.ОбработкаЗавершена = Ложь;
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

Процедура ВыполнитьНастройкуГлавногоУзла(ГлавныйУзел) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГлавныйУзел,
		"СинхронизироватьДанныеПоОрганизациям,СинхронизироватьДанныеПоПодразделениям");
		
	Если Не ЗначенияРеквизитов.СинхронизироватьДанныеПоОрганизациям
		Или Не ЗначенияРеквизитов.СинхронизироватьДанныеПоПодразделениям Тогда
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.АвтономнаяРабота");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ГлавныйУзел);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ГлавныйУзелОбъект = ГлавныйУзел.ПолучитьОбъект();
			ГлавныйУзелОбъект.СинхронизироватьДанныеПоОрганизациям = Истина;
			ГлавныйУзелОбъект.СинхронизироватьДанныеПоПодразделениям = Истина;
			Если ОбновлениеИнформационнойБазы.ЭтоВызовИзОбработчикаОбновления() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ГлавныйУзелОбъект, Истина);
			Иначе
				ГлавныйУзелОбъект.Записать();
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
